# x = {
#     1:"a",
#     2:"b"
    
    
# }

# for key, val in x.items():
#     if val == "a":
#         print(key)

# all_students = []
# while True:
#     st = {}
#     n = input(" ")
#     a = int(input(" "))
#     st.update({n:a})
#     all_students.append(st)
    
#     if input("exit ").lower().startswith("y"):
#         break
    
# print(all_students)


# print([1,2,3] == [3,2,1])
# print({1:"a", 2:"b"} == {2:"b", 1:"a"})
# from gc import collect
# x = {1:["a","c"]}

# del x[1]

# print(x)

# تمرین 1: شمارش تکرار کلمات
# مسئله: یک لیست از کلمات دارید. تعداد تکرار هر کلمه را با استفاده از دیکشنری محاسبه کنید.

# تمرین 2: مرتب‌سازی دیکشنری بر اساس مقادیر
# مسئله: یک دیکشنری با مقادیر عددی دارید، آن را بر اساس مقادیرش به ترتیب نزولی مرتب کنید.

# تمرین 3: ترکیب دو دیکشنری

# مسئله: دو دیکشنری dict1 و dict2 را ترکیب کنید. اگر کلید مشابهی وجود داشت، مقادیر آن‌ها را جمع کنید.

# تمرین 4: حذف کلید با مقدار خاص
# مسئله: از یک دیکشنری کلیدهایی که دارای مقدار خاصی هستند را حذف کنید.

# تمرین 5: یافتن حداکثر و حداقل
# مسئله: حداکثر و حداقل مقدار را در دیکشنری بیابید و کلید مرتبط را نمایش دهید.

